{
	"S1A": [
		"Aoi: (voice tight, eyes fixed on the monitor)Depth reading... three thousand meters and descending. Everyone, gear check.",
		"(The team was scattered throughout the cramped sub. Each member had their own role to play, each with their own thoughts racing as the darkness outside deepened, swallowing them whole. The city below was still a mystery to most of them, a place no one had ever returned from—or so the legends claimed.)",
		"(Daichi, sitting across the room from Aoi, leaned back in his seat, his fingers tapping rhythmically on the console in front of him. He looked almost too calm, an unsettling sense of ease in his demeanor.)",
		"Daichi: We’re on track, everyone. Remember, this is the opportunity of a lifetime. A glimpse into the unknown. Not everyone is brave enough for this journey.",
		"Miyu: *whispering to herself* Let’s just hope it’s worth it...",
		"(Satoshi, the engineer, sat hunched over a set of diagnostics, his brow furrowed in concentration as he scanned the readouts.)",
		"Satoshi: Power’s stable. Nothing’s cracked… yet.",
		"Kawa: *grins* Only because I made those adjustments. We’ll get there in one piece.",
		"(Aoi took a deep breath, scanning the team. This was it—the moment they had all been waiting for, the descent into the unknown. But even as the words of assurance left their mouths, he couldn’t shake the nagging sense of unease gnawing at him. There was something about the city that didn’t sit right, but he wasn’t about to say it aloud.)",
		"Aoi: Remember, once we’re down there, communication with the surface will be difficult. Takiyo, can we keep a stable link?",
		"Takiyo: Stable enough… but I’d prefer not to test it too much.",
		"Daichi: Oh, we’re prepared. Let’s show the world what they’ve been missing beneath these waters.",
		"(Aoi felt the weight of his words, the hollow sense of foreboding growing heavier with each passing second. He couldn't shake the feeling that they were venturing into something far darker than they anticipated.)"
	],
	"S1B1": [
		"Aoi: ... what if this is all too much? What if we can’t make it back?",
		"(Daichi, ever the confident leader, leaned forward, his piercing gaze meeting Aoi’s.)",
		"Daichi: Aoi, trust me. We’re doing what no one else has dared. And we will succeed. The world will remember us for this. We’re not backing out now. Not when we’re so close.",
		"(Aoi felt his pulse quicken. Daichi’s words should have been reassuring, but something about them set him on edge. He didn’t trust this mission, not entirely, and the creeping unease gnawed at his gut.)"
	],
	"S1B2": [
		"Aoi: We need to make sure every system is double-checked. I want a full status report, now.",
		"(Satoshi looked up from his console, irritation flickering in his eyes. He had his own doubts about the mission, but pushing the team for more checks in the middle of the descent seemed like overkill.)",
		"Satoshi: Aoi, we’re fine. Relax. We’ve run these systems a hundred times. Everything’s working as it should.",
		"Daichi: This is no time for hesitation. We’re going in. You either trust us, or you don’t. We’ve prepared for this. All systems are go. No turning back.",
		"Aoi swallowed hard, the weight of Daichi’s words sinking in. They were deep underwater now, descending further into the abyss. The familiar, comforting sound of the surface was already a distant memory.",
		"He couldn’t afford to show weakness, but a lingering voice inside him screamed that something was terribly wrong."
	],
	"S2A": [
		"(The submarine continued its descent, the dark water pressing in on all sides. Aoi's gaze shifted to the faint, flickering outline of the cursed city in the distance, a shadowy silhouette rising from the ocean floor.)",
		"(The deeper they went, the more the atmosphere seemed to thicken, the air growing heavy with the weight of the curse that loomed over the city.)",
		"(The quiet tension was broken by a sudden jolt, causing the crew to grip their seats. The sub groaned in protest, and a few of the monitors blinked out of sync. Aoi’s heart skipped a beat.)",
		"Aoi: What the hell was that?!",
		"(Kawa quickly checked his console, his fingers flying over the keys.)",
		"Kawa: Nothing to worry about, just a minor fluctuation in pressure. We’re fine.",
		"(Suddenly, the lights flickered again. A sharp, eerie sound reverberated throughout the sub, like something scraping against the hull. The team froze, eyes wide, as the distant shadows of the city drew closer, the feeling of isolation pressing down on them.)",
		"(The descent continued, and the city loomed larger, an ancient presence rising from the dark, its secrets waiting to be uncovered—at a cost no one yet understood.)",
		"???: At last, we're almost done... Wait for me, just a little more. Please..."
	],
	"S2B1": [
		"(The submarine jolted again, this time harder, and the lights flickered wildly. The crew exchanged anxious glances, their tension rising as the hull groaned.)",
		"Aoi: This is not just a pressure issue. Something’s wrong. Takiyo, check the communications. Now.",
		"Takiyo: (frantically typing) I... I can’t get a stable link. We’re almost cut off completely.",
		"Daichi: We’re fine. Don’t panic. This is all part of the descent.",
		"(Aoi’s eyes flickered to the monitors, his pulse racing as the depth continued to increase.)",
		"Aoi: We're in uncharted territory now. This city, whatever it is, has to be the source of these disturbances.",
		"(Kawa started typing furiously, muttering to himself.)",
		"Kawa: If we lose comms completely, we're in deep trouble. We’re already too far down. If something happens to the sub, we’re on our own."
	],
	"S2B2": [
		"(The team could feel the sub’s structure strain with each passing moment. The unease was palpable as the city below loomed ever closer.)",
		"Aoi: We need to stay calm. We’re trained for this.",
		"(Satoshi slammed a fist on his console, visibly frustrated.)",
		"Satoshi: Calm? Are you kidding? We’re at the mercy of this sub’s integrity! We don’t know what we’re dealing with down here.",
		"Daichi: Stop panicking. We came here for a reason. We’ll face whatever’s down there together. No turning back.",
		"(The sub groaned again, this time with a metallic screech that sent shivers down everyone’s spine.)",
		"Aoi: This is no longer a simple expedition. This is a fight for survival."
	],
	"S3A": [
		"(The lights dimmed as they passed beneath an overhang in the city, casting a foreboding shadow over the crew. The city's outline was now clearer, revealing eerie structures that seemed both ancient and unnaturally preserved.)",
		"(Aoi couldn’t shake the feeling that they weren’t just exploring. They were intruding on something. The air was thick, heavy with an unspoken presence.)",
		"Kawa: The pressure here is off the charts. We’re close to the bottom. I’m not sure how much longer we can stay this deep.",
		"Takiyo: We don’t have much choice. We need to gather whatever data we can before we’re forced to turn back.",
		"Aoi: Keep the systems running. Satoshi, check for any signs of damage.",
		"(Satoshi was silent for a moment before replying.)",
		"Satoshi: Everything seems stable, for now. But I’m not liking this. It’s too quiet... too unnatural."
	],
	"S3B1": [
		"(As they continued to descend further into the abyss, Aoi’s grip tightened on the armrests. Every instinct in him screamed that something was wrong.)",
		"Aoi: (voice low, tense) Daichi... what if we should turn back? What if we're making a mistake?",
		"(Daichi, ever the leader, didn’t flinch. He simply stared out at the looming city, his expression unreadable.)",
		"Daichi: (coldly) Aoi, we're not leaving now. Not after everything we’ve come this far for. There’s no turning back.",
		"(Aoi’s heart raced as the darkness around them deepened. There was something ancient in the depths, something waiting.)",
		"Aoi: (to himself) What are we awakening down here?"
	]
}
