{
    "intro": [
        "*sea hushing*",
        "Aoi: It's cold...",
        "Aoi: I better head back to the shore.",
        "*muffled sounds*",
        "Aoi: ??",
        "[laughter]",
        "???: You swim like an old man, you know that?",
        "Aoi: Someone has to be responsible. You get distracted too easily.",
        "???: Responsible, huh? That why you keep postponing our trip? I’m starting to think you don’t want to go.",
        "Aoi: Emi, it’s not that. It’s just—",
        "Emi: Work. Always work. Aoi, we promised. Somewhere by the sea, remember? Just you and me. No distractions.",
        "Emi approached Aoi with a soft look in her eyes, placing her hand on his",
        "Emi: Let’s make it happen, okay?",
        "(As Aoi opened his mouth to respond, but the sunlight began to fade. The warm, golden glow shifted into cold, blinding headlights. A deafening screech of tires filled the air.)",
        "*Screech*",
        "Aoi: !!!",
        "Emi: Aoi-",
        "Aoi: Emi! Emi hold on-",
        "(The car spun violently, the world tilting and crashing around them.)",
        "(Shards of glass sparkled like stars in the darkness. Aoi reached out, his hand searching for hers.)",
        "Aoi: *cough* Emi... Emi! Are you okay? Answer me!",
        "[Muffled mumbling]",
        "...",
        "Emi: You promised Aoi! You promised you wouldn't lose me...",
        "Emi: You let me go- You'll let them go...",
        "Aoi: Emi!"
    ],
    "PS1": [
        "Ring! Ring! Ring!",
        "Aoi: gasp- ",
        "(Aoi, drenched in sweat, sat up in his bunk clutching the edge of the mattress.)",
        "(He looked down at his hands—they were trembling. His wedding ring caught the dim light, the cool metal pressing into his skin like a reminder.)",
        "Aoi: Emi... I didn't let you go...",
        "Aoi closed his eyes, steadying his breathing. He knew he wouldn’t sleep again that night.",
        "“You’ll let them go too.”",
        "Aoi: ..."
    ],
    "PS2": [
        "(The briefing room buzzed with faint murmurs as the Sub/merge crew gathered for their final meeting before the descent. The lights were dim, the screen at the front displaying an artist’s impression of a submerged metropolis, its spires stretching eerily toward the ocean’s surface. Despite the sense of awe the image inspired, the atmosphere was heavy with tension.)",
        "(Aoi Nishihara sat quietly at the back, his fingers gripping a cup of coffee gone cold. His sharp eyes, lined with dark circles, flicked across the room, scanning his crewmates. They were some of the best in their fields, but he wondered if even their expertise could prepare them for what lay ahead.)",
        "(At the front of the room, Chief Daichi stood tall, his presence commanding the room's attention. His voice carried a calm confidence, but there was an edge to it, a kind of hunger that Aoi couldn’t ignore.)",
        "Daichi: Ladies and gentlemen, what we’re about to undertake is unprecedented. This isn’t just another expedition—it’s a journey into the unknown. The city we’re about to explore is unlike anything humanity has ever discovered. It’s ancient, untouched, and, most importantly... it’s ours to uncover.",
        "(The screen shifted to show sonar scans of the submerged city, its sprawling ruins faint but unmistakable.)",
        "Daichi: Our government has invested heavily in this mission because of what this city could mean for science, history... and perhaps even our survival. If the materials we’ve detected are as advanced as they seem, this could redefine our understanding of ancient civilizations—and of humanity itself.",
        "(The murmurs grew louder as the implications of Daichi’s words settled over the crew. The stakes weren’t just professional—they were monumental.)",
        "(Aoi leaned back in his chair, his jaw tightening as Daichi spoke. He had been handpicked for this mission, not just for his technical expertise but for his level-headedness under pressure. But no amount of training could quell the unease gnawing at him.)",
        "(His thoughts drifted to the application form he had filled out months ago—the only thing that had kept his mind occupied since...)",
        "Since the accident."
    ],
    "PS3": [
        "(The submarine bay was alive with activity as the Sub/merge crew gathered for their final briefing. The hulking mass of the submarine loomed over them, its sleek design both awe-inspiring and imposing. Floodlights bathed the dock in a cold, sterile glow, illuminating the faces of the 14-member team. Despite the air of professionalism, tension crackled beneath the surface.)",
        "(Daichi, the chief of the expedition, stood front and center, his posture rigid and commanding. His sharp, calculating eyes scanned the team as they assembled. Each member carried their own expertise—and their own burdens.)",
        "Daichi: Ladies and gentlemen, this is it. We are standing on the brink of history. What lies below isn’t just a city—it’s a key to understanding civilizations far older than we ever imagined.",
        "Daichi: But make no mistake, this mission is not without risks. Once we descend, the ocean will test us. The city will test us. I expect each of you to perform your roles with precision and discipline.",
        "(His words hung in the air, heavy with unspoken implications.)",
        "(Miyu stepped forward, her calm demeanor and compassionate voice a contrast to Daichi’s cold authority.)",
        "Miyu: If anyone feels uncertain, now’s the time to speak. This mission is dangerous. There’s no shame in stepping back.",
        "(No one moved. Aoi watched as her words lingered, the crew exchanging glances. He caught Rikona’s expression—her analytical eyes scanning the submarine’s hull as though calculating its odds of survival. Beside her, Satoshi and Kawa adjusted their tool belts, their banter subdued for once.)",
        "Satoshi: This baby’s solid. We’ll keep her running no matter what.",
        "Kawa: *smirks*, Unless, of course, something bites through her first.",
        "(Kenji, the team’s security expert, rolled his eyes and tapped his holstered harpoon gun.)",
        "Kenji: If something bites, I’ll make sure it regrets it.",
        "(Hana, the marine biologist, couldn’t hide her excitement despite the somber atmosphere. Her wide eyes darted toward the holographic projection of the submerged city.)",
        "Hana: Do you think we’ll find life down there? New species, maybe? I’ve been dreaming of this since grad school.",
        "(Gen, the diver specialist, crossed his arms with a wry grin.)",
        "Gen: Let’s hope whatever we find doesn’t dream of eating us.",
        "(The room chuckled nervously, but Takiyo, the communications specialist, remained focused on her tablet, running diagnostics.)",
        "Takiyo: Surface comms are stable for now, but don’t expect miracles once we’re under. The ocean doesn’t like to play nice."
    ],
    "PS4": [
        "(Aoi stayed quiet, observing the crew. They were a mix of personalities—brilliant, resourceful, and occasionally clashing. But beneath the banter, he could sense the tension in their movements, the weight of the unknown pressing on them all.)",
        "His own thoughts drifted to Emi, her memory never far from his mind. He touched the photograph tucked inside his suit’s chest pocket—a small gesture of connection to a world that felt increasingly distant.",
        "???: -hara. Nishihara. Hey Mr. Nishihara-",
        "Daichi: -You’re the calm in the storm. Make sure you stay that way.",
        "(Aoi met his gaze and nodded.)",
        "Aoi: Always."
    ],
    "PS5": [
        "(Daichi turned to the holographic projection of the submerged city, his tone shifting to one of clinical precision.)",
        "Daichi: Our initial scans show the city is spread across five major sectors, with the central spire being our primary target. It’s where we’ll find the artifacts that could redefine history. Navigating the ruins won’t be easy. Toshiko, you’ll lead the mapping effort. We can’t afford to get lost.",
        "Toshiko: With the way this place shifts, staying on course will be a challenge. But I’ll get us there.",
        "Daichi: I agree. Hideyo, you’ll work with Rikona to decode inscriptions and study the ruins. The rest of you know your roles. Stick to them.",
        "(His gaze swept over the team, lingering on Haruto, who stood silently at the edge of the group.)",
        "(Daichi’s loyal accomplice, Haruto’s presence was unassuming, but Aoi noticed the subtle glint of something sharp at his side—a ceremonial dagger, its design unsettlingly ancient.)"
    ],
    "PS6": [
        "As the crew filed into the submarine one by one, their conversations quieter now. The enormity of what lay ahead was finally sinking in. Aoi stood at the hatch, watching as each member disappeared inside. Miyu paused beside him.",
        "Miyu: Are you ready for this?",
        "Aoi: *hesitant* I don’t think anyone can be ready for something like this. But we’ll get through it.",
        "(Miyu smiled faintly, then climbed aboard. Aoi followed, the cold metal of the hatch sealing behind him like a tomb.)",
        "(As the submarine powered up, the hum of the engines filled the cabin. Daichi stood at the helm, addressing the crew one final time.)",
        "Daichi: Remember—this is history in the making. Whatever we find down there, it will be worth it.",
        "(The submarine began its descent, the surface light fading into darkness. Aoi sat by a viewport, watching the ocean swallow them whole. The weight of the abyss pressed against the glass, and the shadows seemed to shift.)",
        "...",
        "(In the silence, Aoi’s thoughts returned to Emi, her voice faint and distant in his mind.)",
        "Emi: You’ll come back, won’t you?"
    ]
}
